gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
/*
 * Board Config
 *
 *  Created on: 3 Feb 2019
 *      Author: sdavi
 */



#include <stdio.h>
#include <ctype.h>
#include <string.h>
#include <stdint.h>
#include "Version.h"
#include "BoardConfig.h"
#include "Devices.h"
#include "RepRapFirmware.h"
#include "SbcInterface.h"
#include "sd_mmc.h"
#include "SPI.h"
#include "HardwareSPI.h"
#include "HardwareSDIO.h"
#include "Platform/Platform.h"
#include "StepTimer.h"

#include "HybridPWM.h"
#include "ff.h"
#include "Hardware/SoftwareReset.h"
#include "Hardware/ExceptionHandlers.h"
#include "NonVolatileMemory.h"

#include "pinmap.h"

#if STM32H7
# include "stm32h7xx_ll_system.h"
# include "core_cm7.h"
#else
# include "stm32f4xx_ll_system.h"
# include "core_cm4.h"
#endif

#if SUPPORT_TMC22xx || SUPPORT_DMA_NEOPIXEL
# include "DMABitIO.h"
#endif
#ifdef TEST_CACHE
extern uint32_t _nocache_ram_start;
extern uint32_t _nocache_ram_end;
#if STM32H7
extern uint32_t _nocache2_ram_start;
extern uint32_t _nocache2_ram_end;
#endif
#include <Cache.h>
#endif


char BoardName[MaxBoardNameLength] = "unknown";
char BoardLongName[MaxBoardNameLength] = "unknown";
char iapFirmwareFile[MaxBoardNameLength*2] = "unknown";
typedef enum {
    SD_SPI1_A,
    SD_SPI1_B,
    SD_SDIO,
    SD_SPI3_A,
    SD_SPI3_B,
    SD_SPI2_A,
    SD_UNKNOWN = 0xfe,
    SD_NONE = 0xff
} SDConfigs;

SDConfigs sdConfig = SD_UNKNOWN;

static constexpr const char* boardConfigFile = "0:/sys/board.txt";
static constexpr const char* bootConfigFile = "0:/rrfboot.txt";
static constexpr const char* pinsConfigFile = "0:/rrfpins.txt";

#if SUPPORT_REMOTE_COMMANDS
static CanAddress DefaultCanExpAddress;
#endif

// board configs
static const boardConfigEntry_t boardConfigs[]=
{
    {"board", &BoardName, 1, cvStringType},
    {"board.longName", &BoardLongName, 1, cvStringType},
    {"leds.diagnostic", &DiagPin, 1, cvPinType},
    {"leds.diagnosticOn", &DiagOnPolarity, 1, cvBoolType},
    {"leds.activity", &ActLedPin, 1, cvPinType},
    {"leds.activityOn", &ActOnPolarity, 1, cvBoolType},

    // initial pin states
    {"pins.SetHigh", PinsSetHigh, MaxInitialPins, cvPinType},
    {"pins.SetLow", PinsSetLow, MaxInitialPins, cvPinType},

    //Steppers
    {"stepper.powerEnablePin", &StepperPowerEnablePin, 1, cvPinType},
    {"stepper.enablePins", DriverEnablePins, NumDirectDrivers, cvPinType},
    {"stepper.stepPins", STEP_PINS, NumDirectDrivers, cvPinType},
    {"stepper.directionPins", DIRECTION_PINS, NumDirectDrivers, cvPinType},
    {"stepper.digipotFactor", &digipotFactor, 1, cvFloatType},
#if HAS_SMART_DRIVERS
    {"stepper.TmcUartPins", TMC_PINS, NumDirectDrivers, cvPinType},
    {"stepper.DriverType", TMC_DRIVER_TYPE, NumDirectDrivers, cvDriverType},
    {"stepper.numSmartDrivers", &totalSmartDrivers, 1, cvUint32Type},
#if SUPPORT_TMC51xx
    {"stepper.num5160Drivers", &num5160SmartDrivers, 1, cvUint32Type},
    {"stepper.spiChannel", &SmartDriversSpiChannel, 1, cvUint8Type},
    {"stepper.csDelay", &SmartDriversSpiCsDelay, 1, cvUint32Type},
#endif
#if HAS_STALL_DETECT && SUPPORT_TMC22xx
    {"stepper.TmcDiagPins", DriverDiagPins, NumDirectDrivers, cvPinType},
#endif
#endif
    //Heater sensors
    {"heat.tempSensePins", TEMP_SENSE_PINS, NumThermistorInputs, cvPinType},
    {"heat.spiTempSensorCSPins", SpiTempSensorCsPins, MaxSpiTempSensors, cvPinType},
    {"heat.spiTempSensorChannel", &TempSensorSSPChannel, 1, cvUint8Type},
    {"heat.thermistorSeriesResistor", &DefaultThermistorSeriesR, 1, cvFloatType},
    
    //ATX Power
    {"atx.powerPin", &ATX_POWER_PIN, 1, cvPinType},
    {"atx.powerPinInverted", &ATX_POWER_INVERTED, 1, cvBoolType},
    {"atx.initialPowerOn", &ATX_INITIAL_POWER_ON, 1, cvBoolType},

    //SDCards
    {"sdcard.internal.type", &sdConfig, 1, cvUint8Type},
    {"sdCard.internal.spiFrequencyHz", &InternalSDCardFrequency, 1, cvUint32Type},
    {"sdCard.external.csPin", &SdSpiCSPins[1], 1, cvPinType},
    {"sdCard.external.cardDetectPin", &SdCardDetectPins[1], 1, cvPinType},
    {"sdCard.external.spiFrequencyHz", &ExternalSDCardFrequency, 1, cvUint32Type},
    {"sdCard.external.spiChannel", &ExternalSDCardSSPChannel, 1, cvUint8Type},

#if SUPPORT_12864_LCD
    {"lcd.lcdCSPin", &LcdCSPin, 1, cvPinType},
    {"lcd.lcdBeepPin", &LcdBeepPin, 1, cvPinType},
    {"lcd.encoderPinA", &EncoderPinA, 1, cvPinType},
    {"lcd.encoderPinB", &EncoderPinB, 1, cvPinType},
    {"lcd.encoderPinSw", &EncoderPinSw, 1, cvPinType},
    {"lcd.lcdDCPin", &LcdA0Pin, 1, cvPinType},
    {"lcd.panelButtonPin", &PanelButtonPin, 1, cvPinType},
    {"lcd.spiChannel", &LcdSpiChannel, 1, cvUint8Type},
#endif
    
    {"SPI0.pins", SPIPins[0], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI1.pins", SPIPins[1], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI2.pins", SPIPins[2], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI3.pins", SPIPins[3], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI4.pins", SPIPins[4], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI5.pins", SPIPins[5], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
#if STM32H7
    {"SPI6.pins", SPIPins[6], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI7.pins", SPIPins[7], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
    {"SPI8.pins", SPIPins[8], NumSPIPins, cvPinType}, //SCK, MISO, MOSI
#endif
    
#if HAS_WIFI_NETWORKING
    {"wifi.espDataReadyPin", &EspDataReadyPin, 1, cvPinType},
    {"wifi.TfrReadyPin", &SamTfrReadyPin, 1, cvPinType},
    {"wifi.espResetPin", &EspResetPin, 1, cvPinType},
    {"wifi.csPin", &SamCsPin, 1, cvPinType},
    {"wifi.serialRxTxPins", &SerialWiFiRxTxPins, NumberSerialPins, cvPinType},
    {"wifi.spiChannel", &WiFiSpiChannel, 1, cvUint8Type},    
    {"wifi.clockReg", &WiFiClockReg, 1, cvUint32Type},
    {"wifi.moduleType", &NetworkModule, 1, cvModuleType},
#endif

#if HAS_SBC_INTERFACE
    {"sbc.TfrReadyPin", &SbcTfrReadyPinConfig, 1, cvPinType},
    {"sbc.csPin", &SbcCsPinConfig, 1, cvPinType},
    {"sbc.spiChannel", &SbcSpiChannel, 1, cvUint8Type},
    {"sbc.loadConfig", &SbcLoadConfig, 1, cvBoolType},
    {"sbc.SBCMode", &SbcMode, 1, cvBoolType},
#endif

