gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
#if NUM_ASYNC_PORTS != 0
    {"serial.aux.rxTxPins", &Serial1RxTxPins, NumberSerialPins, cvPinType},
#endif
#if NUM_ASYNC_PORTS > 1
    {"serial.aux2.rxTxPins", &Serial1RxTxPins, NumberSerialPins, cvPinType},
#endif
    
#if SUPPORT_LED_STRIPS
    {"led.neopixelPin", &NeopixelOutPin, 1, cvPinType},
#endif

#if HAS_VOLTAGE_MONITOR
    {"power.VInDetectPin", &PowerMonitorVinDetectPin, 1, cvPinType},
    {"power.voltage", &VInDummyReading, 1, cvUint32Type},
#endif
#if SUPPORT_ACCELEROMETERS
    {"accelerometer.spiChannel", &AccelerometerSpiChannel, 1, cvUint8Type},
#endif
#if USE_SPICAN
    {"can.spiChannel", &CanSpiChannel, 1, cvUint8Type},
    {"can.csPin", &CanCsPin, 1, cvPinType},
    {"can.spiFrequencyHz", &CanSpiFrequency, 1, cvUint32Type},
#endif
#if STM32H7
    {"can.readPin", &CanReadPin, 1, cvPinType},
    {"can.writePin", &CanWritePin, 1, cvPinType},
#endif
#if SUPPORT_REMOTE_COMMANDS
    {"can.exp.address", &DefaultCanExpAddress, 1, cvUint8Type}
#endif
};


static void ClearConfig() noexcept
{
    const size_t numConfigs = ARRAY_SIZE(boardConfigs);
    for(size_t i=0; i<numConfigs; i++)
    {
        boardConfigEntry_t next = boardConfigs[i];
        for(size_t p=0; p<(next.numItems); p++)
        {
            switch(next.type)
            {
                case cvPinType:
                    ((Pin *)(next.variable))[p] = NoPin;
                    break;
                case cvDriverType:
                    ((DriverType *)(next.variable))[p] = DriverType::unknown;
                    break;
#if HAS_WIFI_NETWORKING
                case cvModuleType:
                    ((NetworkModuleType *)(next.variable))[p] = NetworkModuleType::espauto;
                    break;
#endif
                case cvBoolType:
                    ((bool *)(next.variable))[p] = false;
                    break;
                case cvFloatType:
                    ((float *)(next.variable))[p] = 0.0f;
                    break;
                case cvUint8Type:
                    ((uint8_t *)(next.variable))[p] = 0;
                    break;
                case cvUint16Type:
                    ((uint16_t *)(next.variable))[p] = 0;
                   break;
                case cvUint32Type:
                    ((uint32_t *)(next.variable))[p] = 0;
                    break;
                case cvStringType:
                    strcpy((char *)(next.variable), "");
                    break;
                default:
                    break;
            }
        }
    }
    // We have a few settings that have "special" default values
    TempSensorSSPChannel = SSPNONE;
    DefaultThermistorSeriesR = 4700.0;
    ATX_INITIAL_POWER_ON = true;
    SdSpiCSPins[0] = PA_4;
    SdCardDetectPins[0] = NoPin;
    SdSpiCSPins[1] = NoPin;
    SdCardDetectPins[1] = NoPin;
    ExternalSDCardFrequency = 4000000;
    ExternalSDCardSSPChannel = SSPNONE;
    InternalSDCardFrequency = 25000000;
    LcdSpiChannel = SSPNONE;
    DiagOnPolarity = true;
    ActOnPolarity = true;
    SmartDriversSpiChannel = SSPNONE;
#if HAS_WIFI_NETWORKING
    SamCsPin = PB_12;
    WiFiSpiChannel = SSP2;
#endif
#if NUM_ASYNC_PORTS != 0
    Serial0RxTxPins[0] = PA_10;
    Serial0RxTxPins[1] = PA_9;
#endif
#if HAS_SBC_INTERFACE
    SbcCsPinConfig = PB_12;
    SbcSpiChannel = SSP2;
#endif
#if USE_SPICAN
    CanSpiFrequency = 15000000;
#endif
#if STM32H7
    CanReadPin = PB_8;
    CanWritePin = PB_9;
#endif
#if SUPPORT_REMOTE_COMMANDS
    DefaultCanExpAddress = 255;
#endif
#if HAS_VOLTAGE_MONITOR
    VInDummyReading = 24;
#endif
#if SUPPORT_ACCELEROMETERS
    AccelerometerSpiChannel = SSPNONE;
#endif
    sdConfig = SD_UNKNOWN;
}


static void InitDiagPin()
{
    bool dummy;
    LogicalPin pin;
    if (DiagPin == NoPin && LookupPinName("status", pin, dummy))
    {
        DiagPin = (Pin)pin;
    }
}


uint32_t crc32_for_byte(uint32_t r) 
{
    for(int j = 0; j < 8; ++j)
        r = (r & 1? 0: (uint32_t)0xEDB88320L) ^ r >> 1;
    return r ^ (uint32_t)0xFF000000L;
}

uint32_t crc32(const void *data, size_t n_bytes) 
{
    uint32_t table[0x100];
    uint32_t crc = 0;

    for(size_t i = 0; i < 0x100; ++i)
        table[i] = crc32_for_byte(i);
    for(size_t i = 0; i < n_bytes; ++i)
        crc = table[(uint8_t)crc ^ ((uint8_t*)data)[i]] ^ crc >> 8;
    return crc;
}


#if HAS_SBC_INTERFACE
class InMemoryBoardConfiguration
{
public:
    InMemoryBoardConfiguration() : signature(invalidSignature), length(0) {}
    bool isValid() noexcept;
    void setConfiguration() noexcept;
    void getConfiguration() noexcept;
    void saveToBackupRAM() noexcept;
    void loadFromBackupRAM() noexcept;
    bool isEqual(InMemoryBoardConfiguration& other) noexcept;
private:
    static constexpr uint32_t validSignature = 0xBCBC0002;
    static constexpr uint32_t invalidSignature = 0xBAD0BAD1;
    static constexpr int maxData = 512;
    uint32_t signature;
    uint32_t configEntrySig;
    uint32_t length;
    uint8_t data[maxData];
};

bool InMemoryBoardConfiguration::isValid() noexcept
{
    //debugPrintf("Memory at %x signature %x confSig %x\n", (unsigned)this, (unsigned) signature, (unsigned)configEntrySig);
    return signature == validSignature && configEntrySig == crc32(boardConfigs, sizeof(boardConfigs));
}

void InMemoryBoardConfiguration::setConfiguration() noexcept
{
    if (!isValid()) debugPrintf("Warning: Setting configuration from invalid memory\n");
    uint8_t *pmem = data;
    const size_t numConfigs = ARRAY_SIZE(boardConfigs);
    for(size_t i=0; i<numConfigs; i++)
    {
        const boardConfigEntry_t item = boardConfigs[i];
        uint32_t len = item.numItems*CVTLengths[item.type];
        memcpy(item.variable, pmem, len);
        pmem += len;
    }
}

void InMemoryBoardConfiguration::getConfiguration() noexcept
{
    uint8_t *pmem = data;
    const size_t numConfigs = ARRAY_SIZE(boardConfigs);
    for(size_t i=0; i<numConfigs; i++)
    {
        const boardConfigEntry_t item = boardConfigs[i];
        uint32_t len = item.numItems*CVTLengths[item.type];
        memcpy(pmem, item.variable, len);
        pmem += len;
        if (pmem - data > maxData)
        {
            debugPrintf("Warning configuration data too large\n");
            return;
        }
    }
    length = pmem - data;
    signature = validSignature;
    configEntrySig = crc32(boardConfigs, sizeof(boardConfigs));
    //debugPrintf("config length %d sig %x\n", (int)length, (unsigned)configEntrySig);
}

void InMemoryBoardConfiguration::saveToBackupRAM() noexcept
{
    // enable access to backup RAM
#if STM32H7
    __HAL_RCC_BKPRAM_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    memcpy((void *)D3_BKPSRAM_BASE, this, sizeof(InMemoryBoardConfiguration));
#else
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_RCC_BKPSRAM_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    memcpy((void *)BKPSRAM_BASE, this, sizeof(InMemoryBoardConfiguration));
#endif
}

