gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
void InMemoryBoardConfiguration::loadFromBackupRAM() noexcept
{
    // enable access to backup RAM
#if STM32H7
    __HAL_RCC_BKPRAM_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    memcpy(this, (void *)D3_BKPSRAM_BASE, sizeof(InMemoryBoardConfiguration));
#else
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_RCC_BKPSRAM_CLK_ENABLE();
    HAL_PWR_EnableBkUpAccess();
    memcpy(this, (void *)BKPSRAM_BASE, sizeof(InMemoryBoardConfiguration));
#endif
    //if (isValid())
        //debugPrintf("Loaded valid configuration data from backup RAM\n");
}


bool InMemoryBoardConfiguration::isEqual(InMemoryBoardConfiguration& other) noexcept
{
    return (isValid() && other.isValid() && length == other.length && !memcmp(data, other.data, length));
}
#endif


static inline bool isSpaceOrTab(char c) noexcept
{
    return (c == ' ' || c == '\t');
}
    
BoardConfig::BoardConfig() noexcept
{
}

static void ConfigureGPIOPins() noexcept
{
    initInterruptPins();
    for(size_t i = 0; i < MaxInitialPins; i++)
    {
        SetPinMode(PinsSetLow[i], OUTPUT_LOW);
        SetPinMode(PinsSetHigh[i], OUTPUT_HIGH);
        SetPinMode(SpiTempSensorCsPins[i], INPUT_PULLUP, false);
    }
#if HAS_SMART_DRIVERS
    for(size_t i = 0; i < NumDirectDrivers; i++)
        SetPinMode(TMC_PINS[i], OUTPUT_HIGH);
#endif
    // Handle special cases
    //Init pins for LCD
    //make sure to init ButtonPin as input incase user presses button
    SetPinMode(PanelButtonPin, INPUT, false);
    SetPinMode(LcdA0Pin, OUTPUT_HIGH);
    SetPinMode(LcdBeepPin, OUTPUT_LOW);
    // Set the 12864 display CS pin low to prevent it from receiving garbage due to other SPI traffic
    SetPinMode(LcdCSPin, OUTPUT_LOW);
#if USE_SPICAN
    SetPinMode(CanCsPin, OUTPUT_HIGH);
#endif

    //Init Diagnostcs Pin
#if STARTUP_DELAY
    if ((CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk) != 0)
    {
        // Debugger is active do not allow use of those pins for diag light
        if (DiagPin == SWDIO_PIN || DiagPin == SWCLK_PIN)
            DiagPin = NoPin;
    } 
#endif

    SetPinMode(DiagPin, OUTPUT_LOW);

    // Configure ATX power control
    ATX_POWER_STATE = ATX_INITIAL_POWER_ON;
    SetPinMode(StepperPowerEnablePin, (ATX_POWER_STATE ? OUTPUT_HIGH : OUTPUT_LOW));
}

static void ConfigureSPIPins(SSPChannel dev, Pin clk, Pin miso, Pin mosi) noexcept
{
    SPI::getSPIDevice(dev)->initPins(clk, miso, mosi, NvicPrioritySpi);
    SpiParameters params;
    params.instanceNumber = dev;
    Platform::SetSharedSpiDevice(dev, *(new SharedSpiDevice(params)));
}

static void ConfigureDriveType() noexcept
{
    // first check to see if we have any explcit settings
    for(size_t i = 0; i < NumDirectDrivers; i++)
    {
        if (TMC_DRIVER_TYPE[i] != DriverType::unknown)
        {
            // at least one driver has been set, so we assume all have been
            return;
        }
    }
    // individual drivers have not been set, so we configure using "legacy" settings
    for(size_t i = 0; i < num5160SmartDrivers; i++)
        TMC_DRIVER_TYPE[i] = DriverType::tmcspiauto;
    for(size_t i = num5160SmartDrivers; i < totalSmartDrivers; i++)
        TMC_DRIVER_TYPE[i] = DriverType::tmcuartauto;
    for(size_t i = totalSmartDrivers; i < NumDirectDrivers; i++)
        TMC_DRIVER_TYPE[i] = DriverType::stepdir;
}

static void FatalError(const char* fmt, ...) noexcept
{
    for(;;)
    {
        va_list vargs;
        va_start(vargs, fmt);
        reprap.GetPlatform().DebugMessage(fmt, vargs);
        va_end(vargs);
        delay(2000);
    }
}

static void MessageF(MessageType mtype, const char* fmt, ...) noexcept
{
    va_list vargs;
    va_start(vargs, fmt);
    reprap.GetPlatform().MessageV(nullptr, mtype, fmt, vargs);
    va_end(vargs);
}

static void FlushMessages() noexcept
{
    uint32_t start = millis();
    while(reprap.GetPlatform().FlushMessages() && (millis() - start < 5000))
        ;
}

#if 0
static void CheckDriverPins() noexcept
{
    for(size_t i=0; i<NumDirectDrivers; i++)
    {
        if (DriverEnablePins[i] != NoPin && STEP_PINS[i] != NoPin && DIRECTION_PINS[i] != NoPin)
        {
            pinMode(DriverEnablePins[i], INPUT);
            bool state1 = IoPort::ReadPin(DriverEnablePins[i]);
            pinMode(STEP_PINS[i], OUTPUT_LOW);
            delay(50);
            bool state2 = IoPort::ReadPin(DriverEnablePins[i]);
            pinMode(STEP_PINS[i], INPUT);
            if (state1 != state2 && state2 == false)
            {
                FatalError("Possible short between step and enable pins on driver %d.\nPlease check driver installation/configuration.\n", i);
            }
        }
    }
}
#endif

const char *BoardConfig::GetBootloaderString() noexcept
{
    const uint32_t *BootVectors = (const uint32_t *)0x8000000;
    const char *BootloaderString = (const char *) BootVectors[8];
    // make sure it looks valid...
    if (BootloaderString == nullptr)
        return nullptr;
    if (Strnlen(BootloaderString, 128) >= 128)
        return nullptr;
    if (strstr(BootloaderString, " version ") == nullptr)
        return nullptr;
    return BootloaderString;
}

#if STM32H7
bool BoardConfig::IsBootloaderCanEnabled() noexcept
{
    const char *bootStr = GetBootloaderString();
    if (bootStr == nullptr) return false;
    const char * canPtr = strstr(bootStr, " C:");
    return (canPtr != nullptr) && canPtr[3] == '1';
}
#endif

// Determine how to access the SD card
typedef struct {
    SSPChannel device;
    Pin pins[6];
    uint32_t mode[6];
} SDCardConfig;

// These are our known SD card configurations
static constexpr SDCardConfig SDCardConfigs[] = {
    {SSP1, {PA_5, PA_6, PB_5, PA_4, NoPin, NoPin}, {0x502, 0x502, 0x502, 0x1}}, // SKR Pro
    {SSP1, {PA_5, PA_6, PA_7, PA_4, NoPin, NoPin}, {0x502, 0x502, 0x502, 0x1}}, // GTR
    {SSPSDIO, {PC_8, PC_9, PC_10, PC_11, PC_12, PD_2}, {0xc02, 0xc02, 0xc02, 0xc02, 0xc02, 0xc02}}, // Fly/SDIO
    {SSP3, {PC_10, PC_11, PC_12, PC_9, NoPin, NoPin}, {0x602, 0x602, 0x602, 0x1}}, // MKS?
    {SSP3, {PC_10, PC_11, PC_12, PA_15, NoPin, NoPin}, {0x602, 0x602, 0x602, 0x1}}, // BTT BX
    {SSP2, {PB_13, PB_14, PB_15, PB_12, NoPin, NoPin}, {0x502, 0x502, 0x502, 0x1}}, // BTT kraken?
};

