gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
static bool TryConfig(uint32_t config, bool mount) noexcept
{
    const SDCardConfig *conf = &SDCardConfigs[config];
    if (conf->device != SSPSDIO)
    {
        ConfigureSPIPins(conf->device, conf->pins[0], conf->pins[1], conf->pins[2]);
        sd_mmc_setSSPChannel(0, conf->device, conf->pins[3]);
    }
    else
    {
        HardwareSDIO::SDIO1.InitPins(NvicPrioritySDIO);
        sd_mmc_setSSPChannel(0, conf->device, NoPin);
    }

    if (!mount) return true;

    GCodeResult rslt;
    String<100> reply;
    do
    {
        MassStorage::Spin();
        rslt = MassStorage::Mount(0, reply.GetRef(), false, 100);
    } while (rslt == GCodeResult::notFinished);
    if (rslt == GCodeResult::ok)
        return true;
    // mount failed, reset the hardware
    if (conf->device != SSPSDIO)
        ((HardwareSPI *)(SPI::getSPIDevice(conf->device)))->disable();
    for (size_t i = 0; i < ARRAY_SIZE(conf->pins); i++)
        SetPinMode(conf->pins[i], INPUT, false);    
    sd_mmc_setSSPChannel(0, SSPNONE, NoPin);
    return false;
}    

static bool LoadBoardDefaults() noexcept
{
    ClearConfig();
    // Load the configuration from the embedded file system
    if (BoardConfig::LoadBoardConfigFromFile(bootConfigFile, false))
    {
        MessageF(UsbMessage, "Found boot config for board: %s\n", BoardName);
        // we use the name configured here for the firmware file
        SafeSnprintf(iapFirmwareFile, sizeof(iapFirmwareFile), "firmware_%s.bin", BoardName);
        InitDiagPin();
        return true;
    }
    return false;
}


static SSPChannel InitSDCard(SDConfigs conf, bool mount, bool needed) noexcept
{
    if (conf == SD_UNKNOWN)
    {
        FatalError("Unknown SD card configuration\n");
    }
    else if (conf == SD_NONE)
    {
        if (needed)
            FatalError("SD card is not supported on this board\n");
        return SSPNONE;
    }
    else
    {
        if (TryConfig(conf, mount))
        {
            return SDCardConfigs[conf].device;
        }
        if (needed)
            FatalError("Unable to mount SD card, config %d.\n", conf);
        else
        {
            MessageF(UsbMessage, "Unable to mount SD card using config %d\n", conf);
            return SDCardConfigs[conf].device;
        }
    }
    FatalError("Failed to mount SD card\n");
    return SSPNONE;
}

#if SUPPORT_REMOTE_COMMANDS
void BoardConfig::SetSavedCanExpansionAddress(CanAddress addr) noexcept
{
    if (addr != 255)
    {
        NonVolatileMemory mem;
        mem.SetCanExpansionAddress(addr == 0 ? 255 : addr);
        mem.EnsureWritten();
    }
}

CanAddress BoardConfig::GetSavedCanExpansionAddress() noexcept
{
    NonVolatileMemory mem;
    const CanAddress addr = mem.GetCanExpansionAddress();
    return (addr == 255 ? 0 : addr);
}
#endif

void BoardConfig::Init() noexcept
{
    NVIC_SetPriorityGrouping(0);
    SSPChannel sdChannel = SSPNONE;
	String<100> reply;
#if !HAS_MASS_STORAGE
#error "Invalid board configuration HAS_MASS_STORAGE is required"
#endif

#if STARTUP_DELAY
    for(int i = 0; i < STARTUP_DELAY; i++)
    {
        delay(1);
        if (SERIAL_USB_DEVICE.IsConnected())
        {
            // For some reason if we start using USB straightaway we end up reading back some data we just
            // sent. Adding a small delay seems to fix the problem.
            delay(100);
            debugPrintf("RRF Started....\n");
            break;
        }
    }
#ifdef TEST_CACHE
    debugPrintf("Testing cache configuration\n");
    debugPrintf("_nocache_ram_start %x/%x _nocache2_ram_start %x/%x\n", _nocache_ram_start, &_nocache_ram_start, _nocache2_ram_start, &_nocache2_ram_start);
    Cache::FlushBeforeDMAReceive(&_nocache_ram_start, 256);
    Cache::FlushBeforeDMAReceive(&_nocache2_ram_start, 256);
    Cache::InvalidateAfterDMAReceive(&_nocache_ram_start, 256);
    Cache::InvalidateAfterDMAReceive(&_nocache2_ram_start, 256);
    debugPrintf("Following two should fail\n");
    Cache::FlushBeforeDMAReceive(BoardName, 256);
    Cache::InvalidateAfterDMAReceive(BoardName, 256);
#endif
    uint32_t STime = StepTimer::GetTimerTicks();
    delay(1000);
    debugPrintf("Timer test elapsed: %u\n", (unsigned)(StepTimer::GetTimerTicks() - STime));
#endif
    if (!LoadBoardDefaults())
    {
        // On test builds we may not have embedded data. We assume the Sd card is SDIO and
        // look for the config data on the card
        MessageF(UsbMessage, "Embdded board config not found, please check you have the correct firmware file installed.\nAttempting to fall back to SDIO\n");
        sdChannel = InitSDCard(SD_SDIO, true, true);
        if (!LoadBoardDefaults())
        {
            FatalError("Unable to load board defaults.\n");
        }
        MassStorage::Unmount(0, reply.GetRef());
    }
#if HAS_SBC_INTERFACE
    // See if there is an (optional) config file on the SD card
    sdChannel = InitSDCard(sdConfig, true, false);
    if (sdChannel == SSPNONE)
    {
        // Device does not have an SD card so if in sbc mode load config from sbc
        SbcLoadConfig = true;
    }
    else if (!BoardConfig::LoadBoardConfigFromFile(boardConfigFile))
    {
        // No board.txt
        MessageF(UsbMessage, "Warning: unable to load board configuration from file\n");
        // Enable loading of config from the SBC
        SbcLoadConfig = true;
    }
    if (SbcLoadConfig)
    {
        MessageF(UsbMessage, "Checking for SBC based configuration files\n");
        // Check for a configuration stored in RAM (supplied by the SBC),
        // if found use it and override any config from the card
        InMemoryBoardConfiguration inMemoryConfig;
        inMemoryConfig.loadFromBackupRAM();
        if (inMemoryConfig.isValid())
        {
            MessageF(UsbMessage, "Using RAM based configuration data\n");
            inMemoryConfig.setConfiguration();
            // Set SD config if we haven't already
            if (!MassStorage::IsDriveMounted(0))
                sdChannel = InitSDCard(sdConfig, false, false);
        }
    }
#else
    // Try and mount the sd card and read the board.txt file, error if not present
    sdChannel = InitSDCard(sdConfig, true, true);
    if (sdChannel == SSPNONE)
    {
        FatalError("Failed to load board configuration\n");
        return;
    }
    if (!BoardConfig::LoadBoardConfigFromFile(boardConfigFile))
    {
        // failed to load a valid configuration
        MessageF(UsbMessage, "Warning: unable to load board configuration from file\n");
    }
#endif
    if (MassStorage::IsDriveMounted(0))
        MassStorage::Unmount(0, reply.GetRef());

