gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
    //MessageF(mtype, "\n== USB ==\n");
    //MessageF(mtype, "Read overrun %d\n", (int)USBReadOverrun);
    //USBReadOverrun = 0;
}

//Set a variable from a string using the specified data type
void BoardConfig::SetValueFromString(configValueType type, void *variable, char *valuePtr) noexcept
{
    switch(type)
    {
        case cvPinType:
            *(Pin *)(variable) = LookupPin(valuePtr);
            break;
        case cvBoolType:
            {
                bool res = false;
                
                if(strlen(valuePtr) == 1)
                {
                    //check for 0 or 1
                    if(valuePtr[0] == '1') res = true;
                }
                else if(strlen(valuePtr) == 4 && StringEqualsIgnoreCase(valuePtr, "true"))
                {
                    res = true;
                }
                *(bool *)(variable) = res;
            }
            break;
        case cvFloatType:
            {
                const char *ptr = nullptr;
                *(float *)(variable) = SafeStrtof(valuePtr, &ptr);
            }
            break;
        case cvUint8Type:
            {
                const char *ptr = nullptr;
                uint8_t val = StrToU32(valuePtr, &ptr);
                if(val < 0) val = 0;
                if(val > 0xFF) val = 0xFF;
                
                *(uint8_t *)(variable) = val;
            }
            break;
        case cvUint16Type:
            {
                const char *ptr = nullptr;
                uint16_t val = StrToU32(valuePtr, &ptr);
                if(val < 0) val = 0;
                if(val > 0xFFFF) val = 0xFFFF;
                
                *(uint16_t *)(variable) = val;
                    
            }
            break;
        case cvUint32Type:
            {
                const char *ptr = nullptr;
                *(uint32_t *)(variable) = StrToU32(valuePtr, &ptr);
            }
            break;
        case cvStringType:
            {
                
                //TODO:: string Type only handles Board Name variable
                if(strlen(valuePtr)+1 < MaxBoardNameLength)
                {
                    strcpy((char *)(variable), valuePtr);
                }
            }
            break;
#if HAS_WIFI_NETWORKING
        case cvModuleType:
            *(NetworkModuleType *)(variable) = NetworkModuleType(valuePtr);
            break;
#endif
        default:
            debugPrintf("Unhandled ValueType %d\n", (int)type);
    }
}

bool BoardConfig::LoadBoardConfigFromFile(const char *filePath, bool restricted) noexcept
{
    FileStore * const configFile = MassStorage::OpenFile(filePath, OpenMode::read, 0);
    if (configFile == nullptr)
    {
        MessageF(UsbMessage, "Configuration file %s not found\n", filePath );
        FlushMessages();
        return false;
    }
    MessageF(UsbMessage, "Loading config from %s...\n", filePath );
    char savedBoardName[MaxBoardNameLength];
    memcpy(savedBoardName, BoardName, MaxBoardNameLength);
    BoardConfig::GetConfigKeys(configFile);
    if (restricted)
    {
        // Don't allow changes to the board name
        memcpy(BoardName, savedBoardName, MaxBoardNameLength);
    }
    configFile->Close();
    FlushMessages();
    return true;
}

#if HAS_SBC_INTERFACE
bool BoardConfig::LoadBoardConfigFromSBC() noexcept
{
    // Is this feature disabled?
    if (!SbcLoadConfig) return false;
    // get existing config
    // Force Sbc mode on
    SbcMode = true;
    InMemoryBoardConfiguration oldConfig, newConfig;
    oldConfig.getConfiguration();
    // now ask sbc for new config
    LoadBoardDefaults();
    BoardConfig::LoadBoardConfigFromFile(boardConfigFile);
#if HAS_SMART_DRIVERS
    ConfigureDriveType();
#endif
    // SbcLoadConfig/SbcMode may have been reset force it back on
    SbcMode = SbcLoadConfig = true;
    newConfig.getConfiguration();
    if (oldConfig.isEqual(newConfig))
        MessageF(UsbMessage, "Configurations match\n");
    else
    {
        // store new config into memory that will survive a reboot
        newConfig.saveToBackupRAM();
        MessageF(UsbMessage, "Configurations do not match rebooting to load new settings\n");
        FlushMessages();
        delay(1000);
        reprap.GetSbcInterface().RequestRestart();
        delay(10000);
        // we should never get here!
        reprap.EmergencyStop();
        SoftwareReset(SoftwareResetReason::deliberate); // Reboot
    }
    return true;
}

void BoardConfig::InvalidateBoardConfiguration() noexcept
{
    InMemoryBoardConfiguration emptyConfig;
    emptyConfig.saveToBackupRAM();
}
#endif

static
const boardConfigEntry_t* FindConfigKey(const char *key)
{
    const size_t numConfigs = ARRAY_SIZE(boardConfigs);
    for(size_t i=0; i<numConfigs; i++)
    {
        if(StringEqualsIgnoreCase(key, boardConfigs[i].key))
        {
            return &boardConfigs[i];
        }
    }
    return nullptr;
}

static
size_t SkipWhitespace(size_t pos, const char *line, size_t len)
{
    while(pos < len && isSpaceOrTab(line[pos])) pos++; //eat leading whitespace
    // if we hit a comment we skip to the end of the line
    if (line[pos] == '/' || line[pos] == '#' || line[pos] == ';')
    {
        pos = len;
    }
    return pos;
}

static
bool IsValidChar(char c)
{
    c = tolower(c);
    return isalpha(c) || isdigit(c) || c == '.' || c == '_';
}

bool BoardConfig::GetConfigKeys(FileStore * const configFile) noexcept
{
    constexpr size_t maxLineLength = 256;
    char line[maxLineLength];

    int readLen = configFile->ReadLine(line, maxLineLength);
    while(readLen >= 0)
    {
        //debugPrintf("ReadLine returns %d %s\n", readLen, line);
        size_t len = (size_t) readLen;
        size_t pos = 0;
        pos = SkipWhitespace(pos, line, len);

        if(pos < len){

            //check for comments
            if(line[pos] == '/' || line[pos] == '#' || line[pos] == ';')
            {
                //Comment - Skipping
            }
            else
            {
                const char* key = line + pos;
                // find the end of the key
                while(pos < len && IsValidChar(line[pos])) pos++;
                char* endKey = line + pos;
                pos = SkipWhitespace(pos, line, len);
                if (pos < len && line[pos] == '=')
                {
                    // terminate the key
                    *endKey = 0;
                    // skip the '='
                    pos++;

                    pos = SkipWhitespace(pos, line, len);

