gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
                    //debugPrintf("Key: %s", key);

                    if(pos < len && line[pos] == '{')
                    {
                        // { indicates the start of an array
                        //debugPrintf(" { ");
                        pos++; //skip the {

                        //Array of Values:
                        const boardConfigEntry_t* confEntry = FindConfigKey(key);
                        if(confEntry != nullptr && confEntry->numItems > 1 && (confEntry->type == cvPinType || confEntry->type == cvDriverType))
                        {
                            //matched an entry in boardConfigEntryArray

                            //create a temp array to read into. Only copy the array entries into the final destination when we know the array is properly defined
                            const size_t maxArraySize = confEntry->numItems;
                            
                            //Pin Array Type
                            Pin readArray[maxArraySize];
                            DriverType readArrayDT[maxArraySize];

                            pos = SkipWhitespace(pos, line, len);
                            bool searching = true;
                            size_t arrIdx = 0;

                            //search for values in Array
                            while( searching )
                            {
                                if(pos < len)
                                {
                                    pos = SkipWhitespace(pos, line, len);
                                    if(pos >= len)
                                    {
                                        debugPrintf("Got to end of line before end of array, line must be longer than maxLineLength");
                                        searching = false;
                                        break;
                                    }

                                    bool closedSuccessfully = false;
                                    //check brace isnt closed
                                    if(pos < len && line[pos] == '}')
                                    {
                                        closedSuccessfully = true;
                                        arrIdx--; // we got the closing brace before getting a value this round, decrement arrIdx
                                    }
                                    else
                                    {

                                        if(arrIdx >= maxArraySize )
                                        {
                                            debugPrintf("Error : Too many entries defined in config for array\n");
                                            searching = false;
                                            break;
                                        }

                                        //Try to Read the next Value

                                        //should be at first char of value now
                                        char *valuePtr = line+pos;

                                        //read until end condition - space,comma,}
                                        while(pos < len && IsValidChar(line[pos]))
                                        {
                                            line[pos] = tolower(line[pos]);
                                            pos++;
                                        }
                                        char *endValue = line+pos;
                                        // Skip trailing whitespace
                                        pos = SkipWhitespace(pos, line, len);

                                        // make sure we ended on a valid character
                                        if(pos >= len || (line[pos] != '}' && line[pos] != ','))
                                        {
                                            debugPrintf("Error: invalid array\n");
                                            searching = false;
                                            break;
                                        }

                                        //check if there is a closing brace after value without any whitespace, before it gets overwritten with a null
                                        if(line[pos] == '}')
                                        {
                                            closedSuccessfully = true;
                                        }

                                        *endValue = 0; // null terminate the string

                                        //debugPrintf("%s ", valuePtr);

                                        //Put into the Temp Array
                                        if(arrIdx >= 0 && arrIdx<maxArraySize)
                                        {
                                            switch(confEntry->type)
                                            {
                                                case cvPinType:
                                                    readArray[arrIdx] = LookupPin(valuePtr);
                                                    break;
                                                case cvDriverType:
                                                    readArrayDT[arrIdx] = DriverType(valuePtr);
                                                    break;
                                                default:
                                                    break;
                                            }
                                        }
                                    }

                                    if(closedSuccessfully == true)
                                    {
                                        //debugPrintf("}\n");
                                        //Array Closed - Finished Searching
                                        if(arrIdx >= 0 && arrIdx < maxArraySize) //arrIndx will be -1 if closed before reading any values
                                        {
                                            //All values read successfully, copy temp array into Final destination
                                            //dest array may be larger, dont overrite the default values
                                            for(size_t i=0; i<(arrIdx+1); i++ )
                                            {
                                                switch(confEntry->type)
                                                {
                                                    case cvPinType:
                                                        ((Pin *)(confEntry->variable))[i] = readArray[i];
                                                        break;
                                                    case cvDriverType:
                                                        ((DriverType *)(confEntry->variable))[i] = readArrayDT[i];
                                                        break;
                                                    default:
                                                        break;
                                                }
                                            }
                                            //Success!
                                            searching = false;
                                            break;

