gloomyandy/RepRapFirmware/src/Hardware/STM32/BoardConfig.cpp
                                        }
                                        //failed to set values
                                        searching = false;
                                        break;
                                    }
                                    arrIdx++;
                                    pos++;
                                }
                                else
                                {
                                    debugPrintf("Unable to find values for Key\n");
                                    searching = false;
                                    break;
                                }
                            }//end while(searching)
                        }//end if matched key
                        else
                        {
                            debugPrintf("Key not found or wrong type %s\n", key);
                        }
                    }
                    else
                    {
                        //single value
                        if(pos < len)
                        {
                            //should be at first char of value now
                            char *valuePtr = line+pos;
                            if (*valuePtr == '"')
                            {
                                // quoted string
                                pos++;
                                valuePtr++;
                                while (pos < len && line[pos] != '"') pos++;
                            }
                            else
                            {
                                //read until end condition - space, ;, comment, null,etc
                                while(pos < len && IsValidChar(line[pos])) pos++;
                            }

                            //overrite the end condition with null....
                            line[pos] = 0; // null terminate the string (the "value")
                            //debugPrintf(" value is %s\n", valuePtr);
                            const boardConfigEntry_t* confEntry = FindConfigKey(key);
                            //Single Value config entries have 1 for numItems
                            if(confEntry != nullptr && confEntry->numItems == 1)
                            {
                                //debugPrintf("Setting value\n");
                                //match
                                BoardConfig::SetValueFromString(confEntry->type, confEntry->variable, valuePtr);
                            }
                            else
                            {
                                debugPrintf("Key not found or wrong type %s\n", key);
                            }
                        }
                    }
                }
                else
                {
                    debugPrintf("Missing equals %s\n", line);
                }
            }
        }
        else
        {
            //Empty Line - Nothing to do here
        }

        readLen = configFile->ReadLine(line, maxLineLength); //attempt to read the next line
    }
    return false;
}

void assert_failed(uint8_t *file, uint32_t line)
{
    debugPrintf("Assert failed file %s line %d\n", file, (int)line);
    delay(1000);
}
